# Задача 2: Найдите сумму цифр трехзначного числа.
#n= int (input ('Введите трехзначное число:'))
#d1=n%10
#d2=n%100//10
#d3=n//100
#res=d1+d2+d3
#print (f"Сумма цифр: {res}")

#  Задача 4 : Петя, Катя и Сережа делают из бумаги журавликов. 
#Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
#если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#s= int (input ('Введите общее количество журавликов:'))
#if (s%6==0):
#    a=b=s/6
 #   c=2*(a+b)
  #  print ( f"Петя {a}, Катя {c}, Сережа {b}")
#else:
#    print (f"общее количество не кратно 6")

#Задача 6 Вам требуется написать программу, которая проверяет счастливость билета.

#n= str (input ('Введите шестизначное число:'))
#s1=n[0]+n[1]+n[2]
#s2=n[3]+n[4]+n[5]
#if s1==s2:
#    print('yes')
#else:
#    print('no')
#Задача 8 Требуется определить, можно ли от шоколадки размером n × m долек отломить
# k долек, если разрешается сделать один разлом по прямой между дольками 
#(то есть разломить шоколадку на два прямоугольника).

#n= int (input ('размер шоколада сторона n:'))
#m= int (input ('размер шоколада сторона m:'))
#k= int (input ('количество долек K:'))
#if k<n*m and (k>=n or k>=m) and (k%n==0 or k%m==0):
    #print('yes') 
#else :
    #print('no')





